{
  "metadata": {
    "total_size": 8529007460
  },
  "weight_map": {
    "action_in_proj.bias": "model-00001-of-00003.safetensors",
    "action_in_proj.weight": "model-00001-of-00003.safetensors",
    "action_out_proj.bias": "model-00001-of-00003.safetensors",
    "action_out_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.lm_head.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.0.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.1.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.10.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.11.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.12.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.13.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.14.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.15.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.16.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.17.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.2.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.3.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.4.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.5.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.6.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.7.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.8.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.input_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.input_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.post_attention_layernorm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.post_attention_layernorm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.layers.9.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.norm.dense.bias": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.gemma_expert.model.norm.dense.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.lm_head.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.embed_tokens.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.0.input_layernorm.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.0.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.0.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.0.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.0.post_attention_layernorm.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.0.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.0.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.0.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.0.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.1.input_layernorm.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.1.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.1.mlp.gate_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.1.mlp.up_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.1.post_attention_layernorm.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.1.self_attn.k_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.1.self_attn.o_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.1.self_attn.q_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.1.self_attn.v_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.10.input_layernorm.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.10.mlp.down_proj.weight": "model-00001-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.10.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.10.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.10.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.10.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.10.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.10.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.10.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.11.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.11.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.11.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.11.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.11.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.11.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.11.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.11.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.11.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.12.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.12.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.12.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.12.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.12.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.12.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.12.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.12.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.12.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.13.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.13.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.13.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.13.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.13.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.13.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.13.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.13.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.13.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.14.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.14.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.14.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.14.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.14.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.14.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.14.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.14.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.14.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.15.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.15.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.15.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.15.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.15.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.15.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.15.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.15.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.15.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.16.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.16.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.16.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.16.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.16.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.16.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.16.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.16.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.16.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.17.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.17.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.17.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.17.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.17.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.17.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.17.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.17.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.17.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.2.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.2.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.2.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.2.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.2.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.2.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.2.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.2.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.2.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.3.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.3.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.3.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.3.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.3.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.3.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.3.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.3.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.3.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.4.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.4.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.4.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.4.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.4.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.4.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.4.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.4.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.4.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.5.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.5.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.5.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.5.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.5.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.5.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.5.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.5.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.5.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.6.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.6.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.6.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.6.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.6.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.6.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.6.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.6.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.6.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.7.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.7.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.7.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.7.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.7.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.7.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.7.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.7.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.7.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.8.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.8.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.8.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.8.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.8.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.8.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.8.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.8.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.8.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.9.input_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.9.mlp.down_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.9.mlp.gate_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.9.mlp.up_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.9.post_attention_layernorm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.9.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.9.self_attn.o_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.9.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.layers.9.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.language_model.norm.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.multi_modal_projector.linear.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.multi_modal_projector.linear.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.embeddings.patch_embedding.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.embeddings.patch_embedding.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.embeddings.position_embedding.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.layer_norm1.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.layer_norm1.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.layer_norm2.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.layer_norm2.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.mlp.fc1.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.mlp.fc1.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.mlp.fc2.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.mlp.fc2.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.self_attn.k_proj.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.self_attn.out_proj.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.self_attn.out_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.self_attn.q_proj.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.self_attn.q_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.self_attn.v_proj.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.0.self_attn.v_proj.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.layer_norm1.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.layer_norm1.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.layer_norm2.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.layer_norm2.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.mlp.fc1.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.mlp.fc1.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.mlp.fc2.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.mlp.fc2.weight": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.self_attn.k_proj.bias": "model-00002-of-00003.safetensors",
    "paligemma_with_expert.paligemma.model.vision_tower.vision_model.encoder.layers.1.self_attn.k_proj.weight": "model-00002-of-00003.safetensors",
